/*
задача 2
ДНП, по въведена редица от стойности, цели числа са стойностите,
намира и извежда брой положителни и
сума на отрицателните между тях. Въвеждането приключва при първа въведена стойност 0.
пр вход: 6,-3,12,-22,0 П:2, отрицателни сума:

*/
#include <iostream>
using namespace std; 

int main() {
    int N;
    int broi_pozitivni = 0;
    int sbor_negativni = 0;

    cout << "Въведете редица от цели числа (въведете 0 за приключване):" << endl;

    do {
        cin >> N; // Въвеждане на число

        if (N > 0) {
            broi_pozitivni++; // Ако числото е положително, увеличаваме броя
        }
        else if (N < 0) {
            sbor_negativni += N; // Ако числото е отрицателно, добавяме го към сумата
        }

    } while (N != 0); // Продължаваме докато не получим 0

    // Извеждаме резултатите
    cout << "Брой положителни числа: " <<broi_pozitivni << endl;
    cout << "Сума на отрицателните числа: " << sbor_negativni << endl;

    return 0;
}


